--Добавление данных в таблицу Publisher
INSERT INTO Publisher (Publisher_Name)
VALUES
('Второй'),
('Третий');

--Добавление данных в таблицу Author
INSERT INTO Author (Last_Name, PublisherId)
VALUES
('Первый', null),
('Третий', null),
('Четвертый', 1),
('Шестой', 1),
('Восьмой', 2),
('Девятый', 2);


--Добавление данных в таблицу Book
--Название для удобства проверки запросов: 'Книга НомерИздательства.НомерАвтора.НомерКниги'
INSERT INTO Book (Book_Name, PublisherId, AuthorID)
VALUES
('Книга 1.1.1', null , 1),
('Книга 1.1.2', null , 1),
('Книга 1.2.1', null , null),
('Книга 1.2.2', null , null),
('Книга 1.3.1', null , 2),
('Книга 1.3.2', null , 2),
('Книга 2.4.1', 1 , 3),
('Книга 2.4.1', 1 , 3),
('Книга 2.5.1', 1 , null),
('Книга 2.5.2', 1 , null),
('Книга 2.6.1', 1 , 4),
('Книга 2.6.2', 1 , 4),
('Книга 3.7.1', 2 , null),
('Книга 3.7.2', 2 , null),
('Книга 3.8.1', 2 , 5),
('Книга 3.8.2', 2 , 5),
('Книга 3.9.1', 2 , 6),
('Книга 3.9.2', 2 , 6);


